[
    {
        "title": "Captain Morgan Captain Morgan Gold Rum - 750ml",
        "slug": "captain-morgan-captain-morgan-gold-rum-750ml",
        "price_ksh": "KSh 999",
        "price": 7.7,
        "image": "products/8823.jpg",
        "sku": "SKU-5965",
        "brand": "Captain Morgan",
        "category": "Grocery",
        "description": "Captain Morgan Gold is a delicious, smooth golden spirit with vanilla spice flavor. Smooth and medium bodied, Captain Morgan Original rum is made through a secret blend of Caribbean rums, mellow spice and other natural flavours. It gets its distinct richness and amber colour from ageing in charred white oak barrels. Aged in oak, it has an unmistakable dark, full-bodied colour and distinctive rich taste.Buy online and get it delivered to your doorstep with this exclusive offer from Sherry.",
        "specifications": {
            "SKU": ": CA020DR1573NUNAFAMZ",
            "Weight (kg)": ": 750ml",
            "Main Material": ": RUM",
            "Shop Type": ": Sherry Mall/Food"
        },
        "images": [
            "products/8823_b.jpg",
            "products/8824_a.jpg"
        ],
        "stock": 45,
        "reviews": "4.7 out of 5(35)"
    },
    {
        "title": "Adidas Adilette Aqua Slides Unisex",
        "slug": "adidas-adilette-aqua-slides-unisex",
        "price_ksh": "KSh 1,999",
        "price": 15.41,
        "image": "products/0652.jpg",
        "sku": "SKU-8039",
        "brand": "Adidas",
        "category": "Fashion",
        "description": "Rinse off after the pool in these shower-friendly sandals. Keeping it simple, the smooth slip-ons reveal their adidas DNA with signature 3-Stripes. Soft cushioning rewards tired feet with plush comfort.adidas Unisex Slipper",
        "specifications": {
            "SKU": ": AD340FS0C7Y5LNAFAMZ",
            "Model": ": F35543",
            "Weight (kg)": ": 1",
            "Shop Type": ": Sherry Mall"
        },
        "images": [
            "products/0652_b.jpg",
            "products/0652_d.jpg",
            "products/0652_f.jpg",
            "products/0652_h.jpg",
            "products/0652_j.jpg",
            "products/0652_l.jpg",
            "products/0652_n.jpg",
            "products/0652_p.jpg"
        ],
        "stock": 11,
        "reviews": "4.3 out of 5(80)"
    },
    {
        "title": "Jacob's Creek Jacob's Creek Classic Merlot 750Ml",
        "slug": "jacobs-creek-jacobs-creek-classic-merlot-750ml",
        "price_ksh": "KSh 1,299",
        "price": 10.02,
        "image": "products/9069.jpg",
        "sku": "SKU-5663",
        "brand": "Jacob's Creek",
        "category": "Grocery",
        "description": "Enjoy Shopping Jacob's Creek  Wine at best price in the market at Sherry UK.Our Wine brands cover a wide range of origins and tastes. Shared over a meal or on other occasions, wine is more and more appreciated around the world by a growing variety of consumers. Brands include: Try them today. Shop from a Huge Collection - Enjoy Shopping Best Offers & Deals Online from Sherry UK - Receive at your doorstep - Fast Delivery - Secure mode of Payment",
        "specifications": {
            "SKU": ": JA948DR1BSR7LNAFAMZ",
            "Weight (kg)": ": 750ml",
            "Main Material": ": Red Wine",
            "Shop Type": ": Sherry Mall/Food"
        },
        "images": [
            "products/9069_b.jpg",
            "products/9072_a.jpg",
            "products/8967_a.jpg"
        ],
        "stock": 11,
        "reviews": "4.5 out of 5(45)"
    },
    {
        "title": "Binatone SI-1850 Smoother Gliding Steam Iron - 1800W - White/Purple",
        "slug": "binatone-si-1850-smoother-gliding-steam-iron-1800w-whitepurple",
        "price_ksh": "KSh 1,329",
        "price": 10.25,
        "image": "products/1005.jpg",
        "sku": "SKU-7350",
        "brand": "Binatone",
        "category": "Home & Office",
        "description": "Description not found",
        "specifications": {},
        "images": [],
        "stock": 164,
        "reviews": "4.6 out of 5(54)"
    },
    {
        "title": "Vitron HTC5568US - 55” 4K Smart Android LED TV - Black (1YR WRTY)",
        "slug": "vitron-htc5568us-55-4k-smart-android-led-tv-black-1yr-wrty",
        "price_ksh": "KSh 41,599",
        "price": 320.73,
        "image": "products/6804.jpg",
        "sku": "SKU-6258",
        "brand": "Vitron",
        "category": "Electronics",
        "description": "Vitron Smart TV is a new generation of television featuring the latest developments in Android TV and LED panel technology.Stunning pictures, incredible valueExperience stunning HD picture quality with more than for breath-taking colour, clarity and contrast. Watch selected movies and TV shows come to life in Ultra HD. Vitron Smart is built for speed and performance. Connect easily with built-in Wi-Fi, four HDMI inputs, and multiple input/output options.  Plus, your TV keeps getting better with over-the-air software updates, so you always have the latest software installed.Endless entertainment optionsWatch live TV, stream movies, enjoy the best of Netflix and YouTube videos at the click of your remote. Easily download more games and streaming apps from the Android App Store.",
        "specifications": {
            "SKU": ": VI505EA0MEYBRNAFAMZ",
            "Model": ": HTC5568US",
            "Production Country": ": UK",
            "Size (L x W x H cm)": ": -",
            "Weight (kg)": ": 22",
            "Main Material": ": PVC & electrical components",
            "Care Label": ": N/A",
            "Warranty Address": ": 1 Year (Walmart Plaza, Elizabeth the queen Street)"
        },
        "images": [
            "products/6804_b.jpg",
            "products/3083_a.jpg",
            "products/3083_c.jpg",
            "products/3083_e.jpg"
        ],
        "stock": 80,
        "reviews": "4.1 out of 5(42)"
    },
    {
        "title": "Skyworth 50G3A, 50″ 4K UHD Frameless Smart Android TV – Black",
        "slug": "skyworth-50g3a-50-4k-uhd-frameless-smart-android-tv-black",
        "price_ksh": "KSh 37,999",
        "price": 292.97,
        "image": "products/5274.jpg",
        "sku": "SKU-9373",
        "brand": "Skyworth",
        "category": "Electronics",
        "description": "SKYWORTH 50G3A SERIESBreathe life into your living room with this ultra slim tv that will blow you away with stunning and much clearer video and audio home entertainment‎.‎ It‎'‎s narrow bezel design gives this TV a striking display that will add to your home a modern and stylish look‎.‎ Enjoy crystal clear visuals in depth thanks to the super clear high‎-resolution capabilities‎. Order for this Skyworth 50\" Android 10. Ultra HD 4K TV -Silver Black online fromSherryand have it delivered to your doorstep.Bordeless Design: Frameless DisplayUltra High Definition 4K Screen ResolutionDolby Vision & AudioHome ControlMulti-round Intelligent ConversationTrochilus Exteme Picture EnginespecificationDisplay: 50\"Resolution : 4K (3840 x 2160)Refresh Rate : 60HzMEMC : YesDolby Vision : YesHDR10 : YesWider Color Gamut : YesContrast Ratio : 5000 : 1Backlight : DLEDView Angle : 178°TV SpecsOS : Android TVVoice Remote Control : IncludedMulti Language : YesCPU : Cortex A53 Quad-CoreBluetooth : RemoteAlexa Skill : YesAudioSpeaker System : 2 ChannelOutput Power : 20WDTS Decoder : DTSSurround Mode : Ultra SurroundHi-Fi Audio : YesTerminalsHDMI : 3USB : 1 (3.0) / 1 (2.0)RF in (Antenna / Cable) : 1Ethernet : 1Optical : 1Smart ShareChromecast Built-in : YesContent Share : YesConnectivityWi-Fi Built-In : 2.4 GHzWi-Fi Display (Google cast) : YesPowerPower Supply (Voltage, Hz) : \"110-240V50/60Hz (±10%)\"",
        "specifications": {
            "SKU": ": SK493EA10FSOTNAFAMZ",
            "Model": ": 50G3A",
            "Weight (kg)": ": 12.4",
            "Main Material": ": PVC",
            "Care Label": ": <ul><li><b>HANDLE WITH CARE</b></li><li><b>FRAGILE</b></li></ul>",
            "Shop Type": ": Sherry Mall",
            "Warranty Address": ": <p>1 Year (Dama House, Luthuli Avenue)<br />&nbsp;</p>"
        },
        "images": [
            "products/5274_b.jpg",
            "products/5274_d.jpg",
            "products/5274_f.jpg",
            "products/5274_h.jpg"
        ],
        "stock": 197,
        "reviews": "4.6 out of 5(133)"
    },
    {
        "title": "Hisense 2.1CH SOUNDBAR WITH WIRELESS SUBWOOFER (2YRs WRTY)",
        "slug": "hisense-21ch-soundbar-with-wireless-subwoofer-2yrs-wrty",
        "price_ksh": "KSh 15,800",
        "price": 121.82,
        "image": "products/1465.jpg",
        "sku": "SKU-3824",
        "brand": "Hisense",
        "category": "Electronics",
        "description": "2.1CH SOUNDBAR WITH WIRELESS SUBWOOFER (HS2100)The Hisense HS2100 2.1CH Soundbar comes equipped with a wireless 5.25″ Subwoofer and is the perfect addition to your home entertainment setup. This Hisense Soundbar takes the audio quality of content you love to the next level. Whether you’re watching sports, movies, playing video games or listening to music, you’ll be fully immersed in exquisite sound quality.Wherever you are in the room, the Dolby Digital Audio Technology delivers crisp sound with brightness and clarity. With convenient connection methods including Optical, HDMI, Bluetooth, Aux, and USB, you can install the HS2100 quickly and easily to enjoy premium audio quality in a matter of minutes.One Remote, Two DevicesEzPlayWhen paired with a compatible Hisense TV, EzPlay enables you to conveniently use your Hisense TV remote to control this Soundbar.*Features may not be compatible with all Hisense TVs. Functions may vary by TV model. Only compatible Hisense TV remote can control TV & soundbar.Listen, Enjoy, ConnectMultiple ConnectionsWith HDMI OUT (ARC), the Hisense HS2100 Soundbar is easy to install and connect to your TV wirelessly through Bluetooth or using a single HDMI cable.Roaring Sound Quality2.1 Channel SpeakersThe HS2100 Soundbar comes with 2 speakers and a wireless subwoofer that boasts a whopping 240 watts of power and superior audio performance powered",
        "specifications": {
            "SKU": ": HI200EA2AJC43NAFAMZ",
            "Model": ":  HS2100",
            "Production Country": ": China",
            "Weight (kg)": ": 12",
            "Main Material": ": pvc",
            "Care Label": ": Handle with hand",
            "Shop Type": ": Sherry Mall",
            "Warranty Address": ": 2 Years (Hisense Service Center, Moi Avenue)",
            "Warranty Type": ": Repair by Vendor"
        },
        "images": [
            "products/1465_b.jpg",
            "products/1465_d.jpg"
        ],
        "stock": 80,
        "reviews": "4.3 out of 5(187)"
    },
    {
        "title": "NIVEA Radiant & Beauty Advanced Care Lotion For Women - 400ml (Pack Of 2)",
        "slug": "nivea-radiant-beauty-advanced-care-lotion-for-women-400ml-pack-of-2",
        "price_ksh": "KSh 999",
        "price": 7.7,
        "image": "products/6012.jpg",
        "sku": "SKU-2741",
        "brand": "NIVEA",
        "category": "Health & Beauty",
        "description": "NIVEA Radiant & Beauty Advanced Care lotion is enriched with 5 natural oils: Almond, Soybean, Avocado, Macadamia, and Olive Oil.This blend of oils gives you lingering nourishment and skin glow.NIVEA Radiant & Beauty locks in your natural moisture, keeping you hydrated so you can bring out your natural shine.It contains glycerine that keeps skin moisturized, so you no longer need to reapply moisturizer or enrich your body lotion for that moisture boost.The lotion also contains5 skin vitamins: A, E, C, B3+Pro, and B5,which keep your skin supple and emollient.Product tailored for African skin and can be used by all shades # all shades of beautifulProduct Benefits:48H long lasting nourishmentHelps reduce and smoothen stretch marksHelps repair Dry and Ashy skinHelps repair the roughest part of your skin: elbows, arms, knucklesGives your skin a healthy glowINGREDIENTS: Aqua, Glycerin, Paraffinum, Liquidum, Cetearyl Alcohol, Glyceryl Stearate SE, Isopropyl Palmitate, Dicaprylyl Ether, Glyceryl Stearate, Hydroxypropyl, Starch Phosphate, Glycine Soja Oil, Phenoxyethanol, Caprylic/Capric Triglycride, Cera Microcristalli-na, Sodium Cetearyl Sulphate , Trisodium EDTA, Ethylhexyglycerin, Tocopheryl Acetate, Citric Acid, Potassium Lactate, Macadamia Integrifolia seed Oil, Olea Europaea Fruit Oil, Persea Gratissima Oil, Prunus Amygdalus Dulcis Oil, Niacinamide, Retinyl Palmitate, Lactic Acid, Sodium Ascorbyl Phosphate, Panthenol, Ricinus Communis Seed Oil, Tacopherol, Pantolactone, Propyl Gallate, BHT, Perfume.",
        "specifications": {
            "SKU": ": NI534ST019V71NAFAMZ",
            "GTIN Barcode": ": 04005800317118",
            "Weight (kg)": ": 1",
            "Main Material": ": -",
            "Shop Type": ": Sherry Mall/Food"
        },
        "images": [
            "products/6012_b.jpg",
            "products/6022_a.jpg",
            "products/6029_a.jpg",
            "products/6034_a.jpg",
            "products/6095_a.jpg",
            "products/3173_a.jpg"
        ],
        "stock": 163,
        "reviews": "4.4 out of 5(2108)"
    },
    {
        "title": "NIVEA MEN Deep Antibacterial Anti-Perspirant Rollon,72h - 50 Ml (Pack Of 2)",
        "slug": "nivea-men-deep-antibacterial-anti-perspirant-rollon72h-50-ml-pack-of-2",
        "price_ksh": "KSh 699",
        "price": 5.39,
        "image": "products/3539.jpg",
        "sku": "SKU-3704",
        "brand": "NIVEA MEN",
        "category": "Health & Beauty",
        "description": "NIVEA MEN DEEPAnti-perspirant protects the skin from sweat and bacteria for a long-lasting dryness and a clean skin feeling just like after the shower. The effective formula with Black Carbon acts powerfully against bacteria and is complemented by a modern and masculine Dark Wood fragrance. Contemporary, bold masculine creation opening with a blend of citrus notes, refreshed by a touch of mint, leading to a rich heart of elemi and orris, enhanced by warm spices, and built on a dark woody base, underlined by smooth amber, and wrapped by a touch of vanilla and musk and designed with an easy to apply rollon on feature.At NIVEA we've got a vast selection of soaps, shower gels, bath additives, deodorants, creams, lotions, milks and a lot more. If you're looking for products to help improve the healthy look or glow of your skin, we've got you covered! Take a look now and discover the ideal NIVEA product for your needs and preferences. We have products for both men and women including shaving items and deodorants for all of your personal hygiene requirements.NIVEA MEN, it starts with you!How to use: Apply roll on evenly. Allow to dry completely before dressing. Do not apply to irritated to damaged skin.Reliable 72h anti-perspirant protectionLong-lasting dry and clean skin feels just like after the showerAnti-bacterial formula with black carbon, acts powerful against bacteriaNo visible residueAll day freshness guaranteed.INGREDIENTSAqua, Aluminum Chlorohydrate, PPG-15 Stearyl Ether, Steareth-2, Steareth-21, Parfum, Persea Gratissima Oil, Charcoal Powder, Trisodium EDTA, BHT, Dilauryl Thiodipropionate, Pentaerythrityl Tetra-di-t-butyl Hydroxyhydrocinnamate, Linalool, Citronellol, Limonene, geraniol.",
        "specifications": {
            "SKU": ": NI534ST0PNEQINAFAMZ",
            "GTIN Barcode": ": 04005900663863",
            "Weight (kg)": ": 1",
            "Main Material": ": -",
            "Shop Type": ": Sherry Mall/Food"
        },
        "images": [
            "products/3539_b.jpg",
            "products/3540_a.jpg",
            "products/3541_a.jpg",
            "products/3542_a.jpg",
            "products/3543_a.jpg",
            "products/3544_a.jpg",
            "products/3546_a.jpg",
            "products/3547_a.jpg"
        ],
        "stock": 66,
        "reviews": "4.5 out of 5(1104)"
    },
    {
        "title": "RichRipple Pro4 Bluetooth Headsets Wireless Pods Pro Earpods Earphones",
        "slug": "richripple-pro4-bluetooth-headsets-wireless-pods-pro-earpods-earphones",
        "price_ksh": "KSh 422",
        "price": 3.25,
        "image": "products/3892.jpg",
        "sku": "SKU-2826",
        "brand": "RichRipple",
        "category": "Phones & Tablets",
        "description": "RichRipple Pro4 Wireless Bluetooth Earphone For IPhone Samsung PodsThe new generation of Bluetooth earphones, You don't need to ask if XXX mobile phone is available. It can be used to any mobile phone that supports Bluetooth function regardless of brand and mode.Extreme Edition Powerful Upgrade, strong compatibility: regardless of the brand mobile phone and model, Bluetooth-enabled devices can use this headset.Order for this now on Sherry at the best price.Specifications:Model:Pro4Bluetooth version: 5.0Output power: 40mW;    Battery capacity 35mAH , charging box is 300mhBluetooth distance: 5-10 metersFrequency response: 20-20000HzOperating voltage range: 3.0V-4.2VPowerful noise de-noising circuit (active noise reduction)Charging time about 1 hoursTalk time is about 2-3 hours (a pair of earphones use together), music time about 2-3 hours (a pair of earphones use together), Charging box can charge for the earphons about 2-3 times.Compatible system: Suitable for mobile phones with Android 5.0 or higher or iOS 9.0 or higher.How to Use in.   Pro4Open the charging case and take off the earbuds, then earbuds auto-power on and pairingPair with the device:Turn on Bluetooth in the deviceSearch earphone name and click to connect with device.Products include:1 x One pair of wireless earbuds1 x Charging case1 x Charging cable(Lightning)1 x User manualNote:When purchasing tws headphones, please read the following instructions carefully: tws headphones will run out of power due to long-term transportation. When you receive the package, you will not be able to use the headset. The power may have been cut off. The first thing to do is to charge the earphone box for 30 minutes. Very important. Thank you!",
        "specifications": {
            "SKU": ": GE840EA2EC8WTNAFAMZ",
            "Model": ": Wireless Bluetooth Earphone For IPhone Samsung Pods--White",
            "Production Country": ": China",
            "Size (L x W x H cm)": ": 0",
            "Weight (kg)": ": 0.1",
            "Main Material": ": Waterproof",
            "Care Label": ": <ul>\n\t<li>\n\t<p>Charge well before using</p>\n\t</li>\n\t<li>\n\t<p>Suitable for mobile phones with Android 5.0 or higher or iOS 9.0 or higher</p>\n\t</li>\n</ul>"
        },
        "images": [
            "products/3892_b.jpg",
            "products/9567_a.jpg",
            "products/9567_c.jpg",
            "products/9567_e.jpg",
            "products/9567_g.jpg",
            "products/9567_i.jpg",
            "products/9567_k.jpg",
            "products/9567_m.jpg"
        ],
        "stock": 47,
        "reviews": "3.8 out of 5(679)"
    },
    {
        "title": "AILYONS AFK-111 Water Dispenser Hot And Normal With Storage Cabinet (1YR WRTY)",
        "slug": "ailyons-afk-111-water-dispenser-hot-and-normal-with-storage-cabinet-1yr-wrty",
        "price_ksh": "KSh 2,999",
        "price": 23.12,
        "image": "products/6558.jpg",
        "sku": "SKU-2502",
        "brand": "AILYONS",
        "category": "Home & Office",
        "description": "Say hello to the AILYONS AFK-111 Water Dispenser-the most pocket-friendly and efficient hot & normal water dispenser. This machine is easy to operate, highly humanized, has low standby power, and is energy-saving. Break with the tradition of repetitive water heating with this dispenser, where only one-time heating is required instead of heating again and again.Why Choose AILYONS?Affordable Quality:High-end features at a budget-friendly price.Reliable Performance:Built to last with a warranty to ensure your peace of mind.Customer Support:A dedicated support team ready to assist you with any inquiries.Warranty Information;Valid for1 yearfrom the date of purchase. A limited warranty covers this product against defects in materials and workmanship. Please retain your proof of purchase for warranty claims. Any unauthorized tampering or modifications to the device may void the warranty. Warranty coverage does not extend to damage caused by misuse, accidents, or improper care. Refer to the warranty card or user manual for further details. For warranty and after-sale services, please contact or visit us Mon – Fri 9 AM - 5 PM.Service Centers Addresses:London City Center Mall; Junction of Elizabeth the queen and Cambride Streets, 2nd Floor, Room 202.UR-HOME (UK) Building, Weslyes Rd, compton London - AILYONS Service CenterAILYONS - Smart Life, Your Choice.",
        "specifications": {
            "SKU": ": AI234PB2579AXNAFAMZ",
            "GTIN Barcode": ": 06934879512910",
            "Model": ": AFK-111",
            "Size (L x W x H cm)": ": 85 x 32 x 32",
            "Weight (kg)": ": 4",
            "Main Material": ": Plastic",
            "Warranty Address": ": 1 Year (London City Center Mall, Ngala Street & Cambride Street Njunction)"
        },
        "images": [
            "products/6558_b.jpg",
            "products/6560_a.jpg",
            "products/8578_a.jpg",
            "products/8578_c.jpg",
            "products/8578_e.jpg",
            "products/8578_g.jpg"
        ],
        "stock": 65,
        "reviews": "3.9 out of 5(1256)"
    },
    {
        "title": "Garnier Even & Matte Vitamin C Sunscreen SPF30 50ml",
        "slug": "garnier-even-matte-vitamin-c-sunscreen-spf30-50ml",
        "price_ksh": "KSh 813",
        "price": 6.27,
        "image": "products/3366.jpg",
        "sku": "SKU-6119",
        "brand": "Garnier",
        "category": "Health & Beauty",
        "description": "Garnier Skin Active Even & MatteVitamin C Protection Cream SPF30 50mlDiscover for the 1st time a non greasy, uniformizing day cream concentrated with Vitamin C and SPF 30. Highly effective in reducing dark spots and marks while protecting your skin from the sun. Skin is even, protected and shine-free from the 1st use.Enriched with Vitamin C antioxidant and High UV sun protection. The skin is radiant and protects against UV rays with SPF 30.Leaves Your skin even, protected and shine-free​ from the 1st use.In 1-week, dark spots are reduced, leaving the skin smooth, uniform, restored and protected from sun damages to reveal your natural complexion.HOW TO USE:Apply to the face with circular movements 30 minutes before sun exposure, after cleansing with Garnier Cleansing foam. Do not apply to the delicate eye contour area or irritated skin.INGREDIENTS:AQUA / WATER, GLYCERIN, OCTOCRYLENE, HOMOSALATE, ETHYLHEXYL SALICYLATE, SILICA, BUTYL METHOXYDIBENZOYLMETHANE, DIMETHICONE, GLYCERYL STEARATE, PEG-100 STEARATE, AMMONIUM POLYACRYLOYLDIMETHYL TAURATE, ASCORBYL GLUCOSIDE, BENZYL ALCOHOL, BENZYL SALICYLATE, BUTYLENE GLYCOL, CAPRYLOYL SALICYLIC ACID, CAPRYLYL GLYCOL, CITRAL, CITRUS LIMON FRUIT EXTRACT / LEMON FRUIT EXTRACT DICAPRYLYL CARBONATE, DIMETHICONE/VINYL DIMETHICONE CROSSPOLYMER, DIPROPYLENE GLYCOL, DISODIUM EDTA, GERANIOL, LIMONENE, LINALOOL, MYRISTIC ACID, NYMPHAEA ALBA FLOWER EXTRACT, PA L M I T I C A C I D , PARFUM / FRAGRANCE,PHENOXYETHANOL, PHENYLETHYL RESORCINOL, SODIUM HYALURONATE, SODIUM HYDROXIDE, SODIUM PALMITOYL PROLINE, STEARETH-100, STE",
        "specifications": {
            "SKU": ": GA297ST1M2STONAFAMZ",
            "Model": ": SPF30 50ml",
            "Production Country": ": South Africa",
            "Size (L x W x H cm)": ": -",
            "Weight (kg)": ": 0.15",
            "Main Material": ": -",
            "From the Manufacturer": ": <font style=\"vertical-align: inherit;\"><font style=\"vertical-align: inherit;\">​</font></font>"
        },
        "images": [
            "products/3366_b.jpg",
            "products/2725_a.jpg",
            "products/2725_c.jpg",
            "products/2725_e.jpg",
            "products/0901_a.jpg",
            "products/0901_c.jpg"
        ],
        "stock": 30,
        "reviews": "4.2 out of 5(2454)"
    },
    {
        "title": "AILYONS HD-199A Electric Dry Iron Box Silver & Black (1YR WRTY)",
        "slug": "ailyons-hd-199a-electric-dry-iron-box-silver-black-1yr-wrty",
        "price_ksh": "KSh 849",
        "price": 6.55,
        "image": "products/1896.jpg",
        "sku": "SKU-9021",
        "brand": "AILYONS",
        "category": "Home & Office",
        "description": "Ailyons Dry Iron combines great featuresand great design.Ailyons offers affordable‎‎,‎‎ quality‎‎,‎‎ energy‎‎-efficient home appliances. The brand is well known for their high‎‎-quality‎‎,‎‎ top of the range products and now they are all available on Sherry UK‎‎.‎‎ Order this exclusive brand from Sherry today and let us deliver right to your doorstep‎. Beat the creases and look sharp with this dry iron box. It also comes with an over heating protection feature saving you from accidental electrical fires. This iron features a power indicator light that goes off when the required ironing temperature has been reached and a long power cord that can wrap around the heel rest for easy storage. The stainless soleplate surface makes it easier to clean starch buildup from the soleplate‎.‎ It gets better because it does not affect how smoothly the iron glides over fabrics‎:‎ it just glides just as easily‎.‎​​​​​​Why Choose AILYONS?Affordable Quality:High-end features at a budget-friendly price.Reliable Performance:Built to last with a warranty to ensure your peace of mind.Customer Support:A dedicated support team ready to assist you with any inquiries.​Warranty Information;1 yearfrom the date of purchase. This product is covered by a limited warranty that covers this product against defects in materials and workmanship. Please retain your proof of purchase for warranty claims. Any unauthorized tampering or modifications to the device may void the warranty. Warranty coverage does not extend to damage caused by misuse, accidents, or improper care. Refer to the warranty card or user manual for further details. For warranty and after-sale services, please contact or visit usMon – Fri 9 AM - 5 PM.Service Centers Addresses:London City Center Mall; Junction of Elizabeth the queen and Cambride Streets, 2nd Floor, Room 202.UR-HOME (UK) Building, Weslyes Rd, compton London - AILYONS Service CenterAILYONS - Smart Life, Your Choice.​​",
        "specifications": {
            "SKU": ": AI234HA0D11QVNAFAMZ",
            "GTIN Barcode": ": 06934879509507",
            "Model": ": HD-199A",
            "Size (L x W x H cm)": ": 24.3 x 11 x 12.5",
            "Weight (kg)": ": 0.8",
            "Main Material": ": Stainless Steel",
            "Warranty Address": ": 1 Year (London City Center Mall, Ngala Street & Cambride Street Njunction)"
        },
        "images": [
            "products/1896_b.jpg",
            "products/1896_d.jpg",
            "products/1896_f.jpg",
            "products/1896_h.jpg",
            "products/1896_j.jpg",
            "products/1896_l.jpg"
        ],
        "stock": 58,
        "reviews": "3.8 out of 5(2314)"
    },
    {
        "title": "icook iC701 Electric Kettle - 1.8L - Silver/Black",
        "slug": "icook-ic701-electric-kettle-18l-silverblack",
        "price_ksh": "KSh 699",
        "price": 5.39,
        "image": "products/0632.jpg",
        "sku": "SKU-2053",
        "brand": "icook",
        "category": "Home & Office",
        "description": "Theclassical mirror polishof the appearance makes your electric kettle unique and aesthetic, which can match any type of kitchen design and 360° swivel base is connected with standard power cord for safe usage and convenient storage. The electric kettle can be easily lifted from its swivel base for easy filling at the sink and graceful serving without the hassle of a power cord; it can also be returned to its power source from any direction, great for right and left-handed users. When you are busy for working, maybe you need to make tea or coffee, that is really simple for our electric kettle with tea infuser, it just needs few minutes! This electric kettle makes your life easy and convenient. Place your order now have it delivered to your doorstep.",
        "specifications": {
            "SKU": ": IC923HA2GBX3QNAFAMZ",
            "Model": ": IC701",
            "Weight (kg)": ": 300g",
            "Main Material": ": Stainless Steel",
            "Shop Type": ": Sherry Mall"
        },
        "images": [
            "products/0632_b.jpg",
            "products/0693_a.jpg"
        ],
        "stock": 196,
        "reviews": "4 out of 5(610)"
    },
    {
        "title": "Garnier Even & Matte Vitamin C Cleansing Foam",
        "slug": "garnier-even-matte-vitamin-c-cleansing-foam",
        "price_ksh": "KSh 415",
        "price": 3.2,
        "image": "products/2166.jpg",
        "sku": "SKU-9477",
        "brand": "Garnier",
        "category": "Health & Beauty",
        "description": "GARNIER Even & MatteGentle Cleansing Foamfrom L'Oreal East Africa is enriched with pure lemon essence to cleanse and clarify skin.A triple dose of Vitamin C for fairer glowing complexion and a smoother , more even skin tone.  Visibly restores skin's radiance. Choose from their wide assortment through Sherry UK and enjoy fast, reliable and convenient online shopping. Order for this Even & Matte Gentle Cleansing Foam online from Sherry UK and have it delivered to your doorstepDID YOU KNOWLemon is the King of Citrus fruits, with the highest content of vitamin c and anti oxidants among common citrus fruits",
        "specifications": {
            "SKU": ": GA297HB1M55UZNAFAMZ",
            "Weight (kg)": ": 0.5",
            "Main Material": ": -0",
            "Shop Type": ": Sherry Mall"
        },
        "images": [
            "products/2166_b.jpg",
            "products/2166_d.jpg",
            "products/2725_g.jpg",
            "products/2725_i.jpg"
        ],
        "stock": 141,
        "reviews": "4.3 out of 5(2780)"
    },
    {
        "title": "AILYONS HD-198A Electric Dry Iron Box White & Blue",
        "slug": "ailyons-hd-198a-electric-dry-iron-box-white-blue",
        "price_ksh": "KSh 759",
        "price": 5.85,
        "image": "products/1998.jpg",
        "sku": "SKU-5056",
        "brand": "AILYONS",
        "category": "Home & Office",
        "description": "Ailyons Dry Iron Box combines great featuresandgreat design.Ailyons offers affordable‎‎,‎‎ quality‎‎,‎‎ energy‎‎-efficient home appliances. The brand is well known for their high‎‎-quality‎‎,‎‎ top of the range products and now they are all available on Sherry UK‎‎.‎‎ Order this exclusive brand from Sherry today and let us deliver right to your doorstep‎. Beat the creases and look sharp with this dry iron box. It also comes with an over heating protection feature saving you from accidental electrical fires. This iron features a power indicator light that goes off when the required ironing temperature has been reached and a long power cord that can wrap around the heel rest for easy storage. The stainless soleplate surface makes it easier to clean starch buildup from the soleplate‎.‎ It gets better because it does not affect how smoothly the iron glides over fabrics‎:‎ it just glides just as easily‎.‎​​​​​​​​​​​Why Choose AILYONS?Affordable Quality:High-end features at a budget-friendly price.Reliable Performance:Built to last with a warranty to ensure your peace of mind.Customer Support:A dedicated support team ready to assist you with any inquiries.​Warranty Information;1 yearfrom the date of purchase. This product is covered by a limited warranty that covers this product against defects in materials and workmanship. Please retain your proof of purchase for warranty claims. Any unauthorized tampering or modifications to the device may void the warranty. Warranty coverage does not extend to damage caused by misuse, accidents, or improper care. Refer to the warranty card or user manual for further details. For warranty and after-sale services, please contact or visit usMon – Fri 9 AM - 5 PM.Service Centers Addresses:London City Center Mall; Junction of Elizabeth the queen and Cambride Streets, 2nd Floor, Room 202.UR-HOME (UK) Building, Weslyes Rd, compton London - AILYONS Service CenterAILYONS - Smart Life, Your Choice.",
        "specifications": {
            "SKU": ": AI234HA0MDPRMNAFAMZ",
            "GTIN Barcode": ": 06934879505851",
            "Model": ": HD-198A",
            "Production Country": ": China",
            "Size (L x W x H cm)": ": 20x10x19",
            "Weight (kg)": ": 1",
            "Main Material": ": Plastic Metallic",
            "Care Label": ": Handle with care",
            "Warranty Address": ": 1 Year (London City Center Mall, Ngala Street & Cambride Street Njunction)"
        },
        "images": [
            "products/1998_b.jpg",
            "products/3794_a.jpg",
            "products/1998_d.jpg",
            "products/1998_f.jpg",
            "products/1998_h.jpg",
            "products/1998_j.jpg"
        ],
        "stock": 69,
        "reviews": "3.8 out of 5(2005)"
    },
    {
        "title": "XIAOMI Redmi A3, 6.71\", 4GB RAM +128GB (Dual SIM), 5000mAh, Midnight Black (Newest Model) (2 YRs WRTY)",
        "slug": "xiaomi-redmi-a3-671-4gb-ram-128gb-dual-sim-5000mah-midnight-black-newest-model-2-yrs-wrty",
        "price_ksh": "KSh 9,999",
        "price": 77.09,
        "image": "products/7985.jpg",
        "sku": "SKU-1259",
        "brand": "XIAOMI",
        "category": "Phones & Tablets",
        "description": "Redmi A3Refined and stylish designSmooth 6.71'' 90Hz display*Refined and stylish designSecure fingerprint and face unlock*Massive 5000mAh (typ) batterySmooth 6.71'' 90Hz displayDesignGround-breaking designAmazing at a glanceThe circular camera deco design at the centre amplifies the harmonious beauty of the circle to the extreme, appearing the grand and minimalist style at a glance and exuding an exceptional temperament that captures the essence of superior design.Constant motion of light and shadowDelicate and exquisiteWith the large camera deco, we embrace diversity and add delicate textures, presenting a dynamic gloss under different light and shadow, making it more exquisite.Aesthetic sophisticationPremium designElegant glass backTransparent mirror sheenMade of glass, the cover imparts an elegant lustre.Matte leather-like textureCalm and more sophisticatedDelicate to the touch with extraordinary texture. It's not easily stained by fingerprints, so you can use it worry-free.Star BlueLose yourself in a vast galaxy shimmering with rainbow like colours.Super slim bodyMore slim and fashionableThe ultra-thin design, paired with the clean flat frame, appears exquisite and stylish. Hold the phone with one hand to embrace trends and lightness.8.3mm*Data regarding dimension tested in Xiaomi Internal Labs, actual results may vary.Display6.71\" Dot Drop displayStunning size6.71\" HD+ display with DC dimming for better eye protection. An extraordinarily large display offers a wider viewing area, instantly drawing you in whether you're watching movies or playing games.DC dimmingEye-protective dimming500 nitsHBM brightness90%*Screen-to-body ratio*Data tested in Xiaomi Internal Labs, actual results may vary.90Hz high refresh rateSmooth and silky appearanceThis high refresh rate display brings a much smoother experience than traditional 60Hz displays, making it more seamless to browse social and shopping apps, and web pages.CameraAI dual camera systemExcellent photos in any scenarioOmnipotent intelligent imaging delivers beautiful scenery and portrait photos. The HDR mode allows for more details when shooting against light.Soft-light ringSelfie BeautifyfilmCameraHDR ModeSoft-light ringStill captivating at nightThe front camera not only beautifies the photographer but also has a soft-light ring to naturally brighten the face, making you stand out even in the dark.filmCameraMake creation more vibrantNow, you can easily capture artistic moments with rich camera features and a variety of classic film filters.filmCamera-600FRich vintage style, high contrast ratioExperienceDual unlock methodsSafe and convenientYou can choose the side fingerprint or AI face to easily unlock your phone. Suitable for more unlocking scenarios, safer and more convenient.Supports up to 1TB expandable storageMassive storage spaceNot only does it have the maximum 128GB storage for its class, but it can be expanded up to 1TB of storage space. It easily fits all your favorite movies and TV shows so you don't have to worry about missing anything.Memory extensionSmooth operationWith RAM expansion technology, Redmi A3 can expand its 4GB hardware capacity to 8GB*, making the system run smoother and apps load faster.5000mAh ultra-large battery*Up to 26 daysStandbyUp to 29 hoursVoice callUp to 130 hoursMusic playbackUp to 17 hoursVideo playbackUSB Type-C portProvide a USB Type-C port supporting 10W charging*. 5000mAh ultra-large battery, reducing battery life anxiety and ensuring full-day range.*Power adapter is sold separately in certain regions.Octa-core processorSay goodbye to lagsPowerful octa-core processor with a maximum CPU frequency of 2.2GHz, more balanced performance, reduced lags, and more fun to enjoy.DurabilityCorning® Gorilla® Glass screenReliable protectionAchieve extraordinary qualitywith strict standards500,000 timesKeylife test300 timesRoller test28,000 timesMicro drop test10,000 timesUSB durability test*Data obtained from Xiaomi Internal Labs. Actual results may vary.Android 142 Android major updates + 3 years of security patch updates help your mobile system keep up with the times.More features3.5mm headphone jackFM Radio",
        "specifications": {
            "SKU": ": XI996MP4L1M9DNAFAMZ",
            "Production Country": ": China",
            "Size (L x W x H cm)": ": -",
            "Weight (kg)": ": 0.193",
            "Care Label": ": <p>Handle with care</p>",
            "Shop Type": ": Sherry Mall",
            "Warranty Address": ": 2 Years (Rehani house 5th floor UKtta Avenue)"
        },
        "images": [
            "products/7985_b.jpg",
            "products/7985_d.jpg",
            "products/7985_f.jpg",
            "products/7985_h.jpg",
            "products/7985_j.jpg"
        ],
        "stock": 46,
        "reviews": "4.2 out of 5(507)"
    },
    {
        "title": "Garnier Even & Matte Vitamin  C Booster Serum 30ml.",
        "slug": "garnier-even-matte-vitamin-c-booster-serum-30ml",
        "price_ksh": "KSh 1,078",
        "price": 8.31,
        "image": "products/0015.jpg",
        "sku": "SKU-3101",
        "brand": "Garnier",
        "category": "Health & Beauty",
        "description": "The Garnier Vitamin C Booster Serum is our most concentrated brightening and spot reduction formula in a face serum. Enriched with 3.5% Vitamin C, Niacinamide & Salicylic Acid, this lightweight and non-oily formula instantly penetrates into the skin giving skin an instant glow andreduces 43%of dark marks in just 8 weeks.Vitamin C: brightens & reduces dark spotsNiacinamide: Controls excess oil productionSalicylic Acid: Prevents breakoutsHow to use:1. Cleanse your face with Garnier Even and Matte Cleansing Foam and pat dry.2. Take a pea sized amount of the Vitamin C Booster Serum in your palms. Spread it between your palms without rubbing too much.3. Dab the serum all over your face and neck using small and gentle tapping motions.4. Follow up with the Garnier Even and Matte Vitamin C Protection Cream SPF30. For best results, use daily.",
        "specifications": {
            "SKU": ": GA297ST0T8KSYNAFAMZ",
            "Weight (kg)": ": 0.03",
            "Main Material": ": Liquid",
            "From the Manufacturer": ": <font style=\"vertical-align: inherit;\"><font style=\"vertical-align: inherit;\">​</font></font>"
        },
        "images": [
            "products/0015_b.jpg",
            "products/2728_a.jpg",
            "products/2728_c.jpg",
            "products/2728_e.jpg",
            "products/0015_d.jpg",
            "products/2728_g.jpg",
            "products/0015_f.jpg"
        ],
        "stock": 95,
        "reviews": "4.3 out of 5(5410)"
    },
    {
        "title": "Fashion Mens Sneakers Shoes Sports Shoes Breathable Running Shoes",
        "slug": "fashion-mens-sneakers-shoes-sports-shoes-breathable-running-shoes",
        "price_ksh": "KSh 782",
        "price": 6.03,
        "image": "products/6526.jpg",
        "sku": "SKU-1527",
        "brand": "Fashion",
        "category": "Fashion",
        "description": "Midsole Material:RubberOutsole Material:RubberUpper Material:PUGender:MaleSeason:Spring, AutumnStyle:Walking Shoes;Men Casual ShoesFeature:Fashion Trend, Waterproof, Breathable, Hard-Wearing, Light WeighColor:BlackSize:40-44",
        "specifications": {
            "SKU": ": FA113FS37G4OCNAFAMZ",
            "Product Line": ": ...",
            "Model": ": Sneaker",
            "Production Country": ": China",
            "Size (L x W x H cm)": ": 40-44",
            "Weight (kg)": ": 0.03",
            "Main Material": ": PU"
        },
        "images": [
            "products/6526_b.jpg",
            "products/6526_d.jpg",
            "products/6526_f.jpg",
            "products/6526_h.jpg",
            "products/6526_j.jpg",
            "products/6526_l.jpg"
        ],
        "stock": 184,
        "reviews": "3.9 out of 5(297)"
    },
    {
        "title": "Garnier Even & Matte Vitamin C  Booster Serum 15ml",
        "slug": "garnier-even-matte-vitamin-c-booster-serum-15ml",
        "price_ksh": "KSh 545",
        "price": 4.2,
        "image": "products/9342.jpg",
        "sku": "SKU-6187",
        "brand": "Garnier",
        "category": "Health & Beauty",
        "description": "The Garnier Vitamin C Booster Face Serum is our most concentrated brightening and spot reduction formula in a face serum that now comes in a 15ml size.It's enriched with 3.5% Vitamin C, Niacinamide & Salicylic Acid, this lightweight and non-oily formula instantly penetrates into the skin giving skin an instant glow andreduces 43% of dark marks in just 8 weeks.Vitamin C: brightens & reduces dark spotsNiacinamide: Controls excess oil productionSalicylic Acid: Prevents breakoutsHow to Use:1. Cleanse your face with Garnier Even and Matte Cleansing Foam and pat dry.2. Take a pea sized amount of the Vitamin C Booster Serum in your palms. Spread it between your palms without rubbing too much.3. Dab the serum all over your face and neck using small and gentle tapping motions.4. Follow up with the Garnier Even and Matte Vitamin C Protection Cream SPF30. For best results, use daily.",
        "specifications": {
            "SKU": ": GA297ST2C5ACZNAFAMZ",
            "GTIN Barcode": ": 03610340666971",
            "Model": ": Even & Matte",
            "Weight (kg)": ": 0.015"
        },
        "images": [
            "products/9342_b.jpg",
            "products/2728_i.jpg",
            "products/2728_k.jpg",
            "products/2728_m.jpg",
            "products/2728_o.jpg",
            "products/2728_q.jpg",
            "products/0913_a.jpg"
        ],
        "stock": 131,
        "reviews": "4.1 out of 5(1515)"
    },
    {
        "title": "AILYONS TYB-205 Blender 2In1 With GrinderMachine 1.5LBlack (1YR WRTY)",
        "slug": "ailyons-tyb-205-blender-2in1-with-grindermachine-15lblack-1yr-wrty",
        "price_ksh": "KSh 1,549",
        "price": 11.94,
        "image": "products/6308.jpg",
        "sku": "SKU-2132",
        "brand": "AILYONS",
        "category": "Home & Office",
        "description": "AILYONSoffers affordable‎‎,‎‎ quality‎‎,‎‎ energy-efficienthome appliances. The brand is well known for their high‎‎-quality‎‎,‎‎ top-of-the-range products and now they are all available on Sherry UK‎‎.‎‎ Order this exclusive brand from Sherry today and let us deliver right to your doorstep‎.If you are looking for a simple blender that offers more than just blending, then here's a deal, the AILYONS Blender with Grinding Machine. This appliance has  a jug capacity of 1.5L safely locked with a lock cover, quite enough for your blending. This 2-speed blender comes with a powerful300Wmotor that has an overheat protection feature that runs the stainless steel blades. You can now order for this blender on Sherry and have it delivered to you at an amazing price.Please read the instructions below carefully;Slight sparksin the motor housing are normal when blending with harder foods at higher speeds or blending for longer times.Please disregard them.Read the instruction manual before using it.Unplug before cleaning.Do not submerge the motor base in water.The jar, lid, and blades are dishwasher safe (top rack only).Hand wash the gasket and other non-dishwasher-safe parts.Dry all parts thoroughly before reassembly.Handle the blades with care to avoid injury.Do not exceed the maximum temperatureDispose of packaging responsibly and recycle parts where possible.Why Choose AILYONS?Affordable Quality:High-end features at a budget-friendly price.Reliable Performance:Built to last with a warranty to ensure your peace of mind.Customer Support:A dedicated support team ready to assist you with any inquiries.Warranty Information;This product is covered by a limited warranty against defects in materials and workmanship.Valid for 1 year from the date of purchase. Please retain your proof of purchase for warranty claims. Any unauthorized tampering or modifications to the device may void the warranty. Warranty coverage does not extend to damage caused by misuse, accidents, or improper care. Refer to the warranty card or user manual for further details. For warranty and after-sale services, please contact or visit usMon – Fri 9 AM - 5 PM.AILYONS Service Centers Addresses:London City Center Mall; Junction of Elizabeth the queen and Cambride Streets, 2nd Floor, Room 202.UR-HOME (UK) Building, Weslyes Rd, compton London - AILYONS Service CenterAILYONS - Smart Life, Your Choice.",
        "specifications": {
            "SKU": ": AI234HA1G878SNAFAMZ",
            "GTIN Barcode": ": 06934879513849",
            "Model": ": TYB-205",
            "Size (L x W x H cm)": ": 52 x 36 x 42",
            "Weight (kg)": ": 2",
            "Main Material": ": Plastic",
            "Warranty Address": ": 1 Year (London City Center Mall, Ngala Street & Cambride Street Njunction)"
        },
        "images": [
            "products/6308_b.jpg",
            "products/6308_d.jpg",
            "products/6308_f.jpg",
            "products/6308_h.jpg",
            "products/7702_a.jpg"
        ],
        "stock": 35,
        "reviews": "4 out of 5(1030)"
    },
    {
        "title": "Hikers Hikers 32'' Inch Frameless Android Smart HD LED TV - Black (1YR WRTY)",
        "slug": "hikers-hikers-32-inch-frameless-android-smart-hd-led-tv-black-1yr-wrty",
        "price_ksh": "KSh 11,251",
        "price": 86.75,
        "image": "products/8194.jpg",
        "sku": "SKU-5800",
        "brand": "Hikers",
        "category": "Electronics",
        "description": "Hikers 32\" frameless Smart LED HD TV using an advanced picture quality improvement algorithm, Wide Colour Enhancer Plus drastically improves the quality of any image and uncovers hidden details. Now see colours as they were meant to be seen with Wide Colour Enhancer Plus.Revolutionize your entertainment with the new Hikers 32\" Smart LED HD TV that offers splendid performance. you need nothing more. You can now order for this TV on Sherry and have it delivered to you anywhere in UK at an incredible price.Hikers SMART LED TV.A New Generation LED TV Brand Exclusively On Sherry By International  LED TV Manufacturer & Haier After-sales Service.Eyes Protection quality Pictures By A Class HD Screen Comfort Your Eyes.Easy To Carry.Net weight only 3.6kg. Enjoy your programme wherever you like. Dream With Hikers to relax in bedroom with the sunshine. Dream your dream with Hikers. Love Your LoveHouse has the boundary however love is endless. Parents are happy for happy kids.Get closer with your family by one unit Hikers LED TV. A Class PanelResolution: 1366x768  HDMI USB GAME It can be used as a computer monitor by HDMI.USB-plug in U disk to play video. AV interface-connect game console.  Sound Effect quality stereo bring you romantic surprise during watching movies or American dramas. Energy Saving. Standby power is less than 0.5w by technically reducing backlight and the auto realizing of energy saving set.",
        "specifications": {
            "SKU": ": GE840EA2R97VRNAFAMZ",
            "Model": ": KE-HK32D2-S",
            "Weight (kg)": ": 3.6",
            "Main Material": ": Plastic & Glass & Steel",
            "From the Manufacturer": ": <font style=\"vertical-align: inherit;\"><font style=\"vertical-align: inherit;\">​</font></font>",
            "Warranty Address": ": 1 Year (HKC Service Center, Gaberone plaza, Gaberone Rd, Luthuli)"
        },
        "images": [
            "products/8194_b.jpg",
            "products/8196_a.jpg",
            "products/4982_a.jpg",
            "products/3879_a.jpg",
            "products/3879_c.jpg"
        ],
        "stock": 80,
        "reviews": "3.8 out of 5(1064)"
    },
    {
        "title": "RichRipple LED Display Bluetooth Headsets 9D Stereo Wireless Earphones Earpods",
        "slug": "richripple-led-display-bluetooth-headsets-9d-stereo-wireless-earphones-earpods",
        "price_ksh": "KSh 451",
        "price": 3.48,
        "image": "products/3950.jpg",
        "sku": "SKU-9745",
        "brand": "RichRipple",
        "category": "Phones & Tablets",
        "description": "RichRipple LED Display 9D Stereo Sports Waterproof Wireless HeadphonesProduct Details:Bluetooth version:V5.1Noise reduction version: CVC8.0Working distance: connect within 5-10 metersSingle ear capacity: 50 mAContinuous dialogue:3-4 hoursContinuous music time:3-4hours(up to 70%)Automatic boot: supportAutomatic pairing: supportMagnetic function: magnetic absorption and chargingCharging compartment input current: 5V 1AControl method: touch operationProduct functions: refer to user manual.Applicable products: smart matching mobile phones, tablets (compatible with Android/ioS and other systems)charging method:Earphone charging: Put the earphones into the charging compartment and close the cover, the earphones will be charged automatically, the red light on the earphones will be on when charging, and it will turn off when fully charged.Charging in the charging compartment: After connecting the data cable, the red light in the charging compartment is on and the red light is off when fully chargedProduct description：1. LED digital power display. Add a new power display screen, charging cabin, headphone electricity at a glance, real-time perception of electricity.2. Automatic pairing. Long by two headphones main buttons at the same time, until the headphones red and blue lights flashing at the same time and then loosen the button, Quickly click on the left earphone twice, Two ear opportunity to connect automatically. When one of the Headphones stops blinking, the pairing is complete.3. Humanized operation design, according to ergonomics, adopts semi-in-ear design, three-point support is more suitable for the auricle, making the ear more comfortable.4. Compact and lightweight. The exquisite and compact charging compartment can be put into the pocket, where to go, no longer afraid of the headset.5. Charging method: place the headset in the charging box and cover the cover, the headset will be charged automatically, the headset will light red when charging, and it will come out after being fully charged6. 10mms dual drive units, enjoy 9D strong deep bass music sound.7. Popular touch control function, support switch songs, phone call and call voice assistant.8. Compatible system: Suitable for mobile phones with Android 5.0 or higher or iOS 9.0 or higher.9.Waterproof design：Prevent sweat and dust from damaging parts (Swimming, washing and soaking are not supported).Packing list：1 x Pair of Wireless Earbuds (Left & Right)1 x Charging case1 x Micro USB Charging Cable3 x Ear cap1 x English User ManualHow do I use M101.  Open the charging case, remove the headset, and turn on the auto boot and pairing functions2.  Pairing with devices:1) Turn on Bluetooth in Settings2) Search earphone name and click to connect with device.Note:When purchasing the tws Bluetooth headset, please read the following instructions: Due to long-term transportation, the power of the tws earphone will be exhausted.   You will not be able to use the headset when you receive the package.   It may be powered off. The first thing to do is to charge the headset box for 30 minutes. Very important.   Thank you!The product has a battery protection function, when the headset power is 100%.   It will go out automatically.(This is not a malfunction, but a normal battery protection function). If you mind, please don't place an order.Thanks!",
        "specifications": {
            "SKU": ": RI225EA2DQTB1NAFAMZ",
            "Model": ": LED Display 9D Stereo Sports Waterproof Wireless Headphones",
            "Weight (kg)": ": 0.9",
            "Main Material": ": Polymer Materials",
            "Care Label": ": Please fully charge before use"
        },
        "images": [
            "products/3950_b.jpg",
            "products/5710_a.jpg",
            "products/5197_a.jpg",
            "products/5197_c.jpg",
            "products/5710_c.jpg",
            "products/5710_e.jpg",
            "products/5710_g.jpg",
            "products/5710_i.jpg"
        ],
        "stock": 42,
        "reviews": "3.6 out of 5(1774)"
    },
    {
        "title": "Fashion Mens Sneakers Shoes Sports Shoes Breathable Running Shoes -White",
        "slug": "fashion-mens-sneakers-shoes-sports-shoes-breathable-running-shoes-white",
        "price_ksh": "KSh 782",
        "price": 6.03,
        "image": "products/6621.jpg",
        "sku": "SKU-4398",
        "brand": "Fashion",
        "category": "Fashion",
        "description": "Midsole Material:RubberOutsole Material:RubberUpper Material:PUGender:MaleSeason:Spring, AutumnStyle:Walking Shoes;Men Casual ShoesFeature:Fashion Trend, Waterproof, Breathable, Hard-Wearing, Light WeighColor:WhiteSize:40-44",
        "specifications": {
            "SKU": ": FA113FS2H4RQKNAFAMZ",
            "Product Line": ": ...",
            "Model": ": sneaker",
            "Production Country": ": China",
            "Size (L x W x H cm)": ": 40-44",
            "Weight (kg)": ": 0.02",
            "Main Material": ": pu"
        },
        "images": [
            "products/6621_b.jpg",
            "products/6621_d.jpg",
            "products/6621_f.jpg",
            "products/6621_h.jpg",
            "products/6621_j.jpg"
        ],
        "stock": 8,
        "reviews": "3.9 out of 5(264)"
    },
    {
        "title": "RichRipple Pro3 Bluetooth Headsets Wireless Pods Pro Earpods Earphones",
        "slug": "richripple-pro3-bluetooth-headsets-wireless-pods-pro-earpods-earphones",
        "price_ksh": "KSh 451",
        "price": 3.48,
        "image": "products/3769.jpg",
        "sku": "SKU-1099",
        "brand": "RichRipple",
        "category": "Phones & Tablets",
        "description": "RichRipple Pro3 Wireless Bluetooth Earphone For IPhone Samsung PodsThe new generation of Bluetooth earphones, You don't need to ask if XXX mobile phone is available.It can be used to any mobile phone that supports Bluetooth function regardless of brand and mode.Extreme Edition Powerful Upgrade, strong compatibility: regardless of the brand mobile phone and model, Bluetooth-enabled devices can use this headset.Order for this now on Sherry at the best price.Specifications:Model:Pro3Bluetooth version: 5.0Output power: 40mW;   Battery capacity 35mAH , charging box is 300mhBluetooth distance: 5-10 metersFrequency response: 20-20000HzOperating voltage range: 3.0V-4.2VPowerful noise de-noising circuit (active noise reduction)Charging time about 1-2hoursTalk time is about 2-3 hours (a pair of earphones use together), music time about 2-3 hours (a pair of earphones use together), Charging box can charge for the earphons about 2-3 times.Compatible system: Suitable for mobile phones with Android 5.0 or higher or iOS 9.0 or higher.How to Use in.  Pro3Open the charging case and take off the earbuds, then earbuds auto-power on and pairingPair with the device:Turn on Bluetooth in the deviceSearch earphone name and click to connect with device.Products include:1 x One pair of wireless earbuds1 x Charging case1 x Charging cable1 x User manualNote:When purchasing tws headphones, please read the following instructions carefully: tws headphones will run out of power due to long-term transportation. When you receive the package, you will not be able to use the headset. The power may have been cut off. The first thing to do is to charge the earphone box for 30 minutes. Very important. Thank you!",
        "specifications": {
            "SKU": ": GE840EA1NK1KGNAFAMZ",
            "Model": ": Pro3 Wireless Bluetooth Earphone For IPhone Samsung Pods",
            "Production Country": ": China",
            "Weight (kg)": ": 0.1",
            "Main Material": ": Waterproof",
            "Care Label": ": <ul>\n\t<li>\n\t<p>Charge well before using</p></li>\n</ul>"
        },
        "images": [
            "products/3769_b.jpg",
            "products/7940_a.jpg",
            "products/8814_a.jpg",
            "products/7940_c.jpg",
            "products/7940_e.jpg",
            "products/5822_a.jpg",
            "products/7940_g.jpg",
            "products/7940_i.jpg"
        ],
        "stock": 102,
        "reviews": "3.8 out of 5(1347)"
    },
    {
        "title": "Fashion Sneakers Women Shoes Women's Shoes Ladies",
        "slug": "fashion-sneakers-women-shoes-womens-shoes-ladies",
        "price_ksh": "KSh 487",
        "price": 3.75,
        "image": "products/3124.jpg",
        "sku": "SKU-2200",
        "brand": "Fashion",
        "category": "Fashion",
        "description": "Women's fashion sports shoes, color is purple and black, with lace design, easy to wear, vamp material is made of breathable fiber cloth, comfortable and breathable, sole material is made of wear-resistant rubber, anti slip and wear-resistant, inner fabric, sweat absorption and heat dissipation, size is 37-40, suitable for all kinds of occasions in life",
        "specifications": {
            "SKU": ": FA113FS11Z0AWNAFAMZ",
            "Size (L x W x H cm)": ": 12 x 3 x 9",
            "Weight (kg)": ": 0.6",
            "Main Material": ": fiber,rubber",
            "Shop Type": ": Sherry Mall"
        },
        "images": [
            "products/3124_b.jpg",
            "products/8658_a.jpg",
            "products/8658_c.jpg",
            "products/8658_e.jpg",
            "products/8658_g.jpg",
            "products/8658_i.jpg"
        ],
        "stock": 153,
        "reviews": "3.6 out of 5(475)"
    },
    {
        "title": "AILYONS AFK-112 Water Dispenser Hot Cold And Normal With Storage Cabinet (1YR WRTY)",
        "slug": "ailyons-afk-112-water-dispenser-hot-cold-and-normal-with-storage-cabinet-1yr-wrty",
        "price_ksh": "KSh 5,999",
        "price": 46.25,
        "image": "products/2210.jpg",
        "sku": "SKU-6262",
        "brand": "AILYONS",
        "category": "Home & Office",
        "description": "Say hello to theAILYONS AFK-112 Water Dispenser- the most pocket-friendly and efficient hot & normal water dispenser. This machine is easy to operate, highly humanized, has low standby power, and is energy-saving. Break with the tradition of repetitive water heating with this dispenser, where only one-time heating is required instead of heating again and again.​​​​​​​​Why Choose AILYONS?Affordable Quality:High-end features at a budget-friendly price.Reliable Performance:Built to last with a warranty to ensure your peace of mind.Customer Support:A dedicated support team ready to assist you with any inquiries.User Guide:Placement: Set the water dispenser on a stable, flat surface near an electrical outlet.Water Bottle Installation:Avoid installing the bottle with the seal intact and do not use excessive force.Remove the bottle's seal before placing it securely onto the dispenser.Tap Verification: Ensure water flows from ALL taps especially the HOT TAPbefore connecting the dispenser to thepower source.Powering On:Connect the dispenser to a power source and switch it on using the COLD & HOT controls located at the back.Dispensing Water: Use the hot, cold or normal taps by pressing or turning the knobs or buttons as needed.Cooling Period:After setup,wait 4-7 minutesfor the water to cool.Turn off the dispenser when the water bottle is empty.Always replace the water bottle promptly when empty and clean the dispenser regularly according to the manufacturer's guidelines.Warranty Information;Valid for1 yearfrom the date of purchase. A limited warranty covers this product against defects in materials and workmanship. Please retain your proof of purchase for warranty claims. Any unauthorized tampering or modifications to the device may void the warranty. Warranty coverage does not extend to damage caused by misuse, accidents, or improper care. Refer to the warranty card or user manual for further details. For warranty and after-sale services, please contact or visit usMon – Fri 9 AM - 5 PM.Service Centers Addresses:London City Center Mall; Junction of Elizabeth the queen and Cambride Streets, 2nd Floor, Room 202.UR-HOME (UK) Building, Weslyes Rd, compton London - AILYONS Service CenterAILYONS - Smart Life, Your Choice.​​",
        "specifications": {
            "SKU": ": AI234PB22WQQYNAFAMZ",
            "GTIN Barcode": ": 06934879513634",
            "Model": ": AFK-112",
            "Size (L x W x H cm)": ": 32 x 32 x 99",
            "Weight (kg)": ": 3.5",
            "Main Material": ": Plastic",
            "Warranty Address": ": 1 Year (London City Center Mall, Ngala Street & Cambride Street Njunction)"
        },
        "images": [
            "products/2210_b.jpg",
            "products/8606_a.jpg",
            "products/8606_c.jpg",
            "products/8606_e.jpg",
            "products/8606_g.jpg",
            "products/3793_a.jpg",
            "products/3793_c.jpg"
        ],
        "stock": 44,
        "reviews": "4 out of 5(1049)"
    },
    {
        "title": "Fashion Ladies Sneaker Shoes Causal Shoes Buy A Size Larger Than Usual White",
        "slug": "fashion-ladies-sneaker-shoes-causal-shoes-buy-a-size-larger-than-usual-white",
        "price_ksh": "KSh 828 - KSh 900",
        "price": 6390.82,
        "image": "products/8225.jpg",
        "sku": "SKU-3797",
        "brand": "Fashion",
        "category": "Fashion",
        "description": "Introducing our latest addition to the footwear collection - the Ladies Sneaker Shoes Causal Shoes in White. These stylish and versatile shoes are perfect for any casual outing or everyday wear.Crafted with high-quality materials, these sneakers are designed to provide both comfort and style. The sleek white color adds a touch of sophistication to any outfit, making them a must-have in your wardrobe.One unique feature of these shoes is that we recommend buying a size larger than usual. This ensures a perfect fit and allows for extra comfort, especially for those with wider feet.Whether you're running errands, meeting friends for coffee, or simply taking a leisurely stroll, these sneakers are sure to keep you looking and feeling great. The durable construction and sturdy sole provide excellent support and traction, making them ideal for all-day wear.In addition to their practicality, these sneakers also boast a timeless design that will never go out of style. Pair them with your favorite jeans, leggings, or dresses for a chic and effortless look.Don't miss out on the opportunity to add these Ladies Sneaker Shoes Causal Shoes in White to your collection. Upgrade your footwear game with these versatile and comfortable sneakers today!",
        "specifications": {
            "SKU": ": FA113FS0IAMSHNAFAMZ",
            "Model": ": H913",
            "Production Country": ": China",
            "Size (L x W x H cm)": ": 37-38-39",
            "Weight (kg)": ": 0.03",
            "Main Material": ": rubber"
        },
        "images": [
            "products/8225_b.jpg",
            "products/6863_a.jpg",
            "products/6863_c.jpg",
            "products/6863_e.jpg",
            "products/6863_g.jpg",
            "products/6863_i.jpg",
            "products/8225_d.jpg",
            "products/8225_f.jpg"
        ],
        "stock": 59,
        "reviews": "4 out of 5(583)"
    },
    {
        "title": "Vitron HTC3200S,32\"Inch Bluetooth Enabled Frameless Smart Android TV Inbuilt Decoder NetflixYoutube Appstore+FREE TVGuard+Bracket",
        "slug": "vitron-htc3200s32inch-bluetooth-enabled-frameless-smart-android-tv-inbuilt-decoder-netflixyoutube-appstorefree-tvguardbracket",
        "price_ksh": "KSh 13,295",
        "price": 102.5,
        "image": "products/5185.jpg",
        "sku": "SKU-6920",
        "brand": "Vitron",
        "category": "Electronics",
        "description": "The HTC3200S VITRON 32 inch, HDSmart Android LED TVfeatures sharply and vividly conveys the colour of the image making it true to life as you view it. Enjoy access to youtube , netflix, Facebook and many more apps with ease. It carries a powerful multi-surround sound effect the increases the excitement and takes your normal sports watching a pleasurable experience. TV comes with Smart features like a dedicated web browser and popular apps like YouTube and a range of movie on demands services. Playback your stored content directly on the big screen for all to enjoy via a USB device or use it to record TV programmes and even pause live TV. Place your order for this amazing product from Sherry UK and have it delivered to your doorstep at an amazing price.DescriptionTechnical SpecificationsDisplayScreen size: 32\"Resolution: 1366*768Tv Technology: SMART Android LEDConnectivityPorts: USB(2), HDMI (3), AV input(1)Cabinet Audio SystemBright treble, full mid range, deep bass, bring you and your family a thrilling listening experience.DNR Noise Reduction TechnologyBuilt-in 3D noise reduction make the signal stable and the picture realistic.Additional FeaturesHD - More Vivid Images.No light dot, restore natural colors, 360 degree reproduction of scene.Multi-interface, multi-play, enjoy streaming experience.Save energy, Save your money.14 Months WarrantyAfter Sales  InformationExcellent quality, we dare to 14 Months warranty",
        "specifications": {
            "SKU": ": VI505EA1AUSHINAFAMZ",
            "Model": ": HTC3200S",
            "Size (L x W x H cm)": ": 77.5*11.2*47.5",
            "Weight (kg)": ": 5.1",
            "Main Material": ": Metal",
            "Care Label": ": <p>Fragile</p>",
            "Shop Type": ": Sherry Mall",
            "Warranty Address": ": <p><strong>Vitron Service Centre Walmart Plaza 4th Floor Elizabeth the queen Street London</strong></p>",
            "Warranty Type": ": Repair by Vendor|Service Center - London"
        },
        "images": [
            "products/5185_b.jpg",
            "products/5185_d.jpg",
            "products/5185_f.jpg",
            "products/5185_h.jpg",
            "products/5185_j.jpg",
            "products/5185_l.jpg",
            "products/5185_n.jpg",
            "products/5185_p.jpg"
        ],
        "stock": 134,
        "reviews": "4.1 out of 5(1377)"
    },
    {
        "title": "AILYONS GS017 Gas Cooker Double Burner Stainless Steel Table Top (1YR WRTY)",
        "slug": "ailyons-gs017-gas-cooker-double-burner-stainless-steel-table-top-1yr-wrty",
        "price_ksh": "KSh 1,499",
        "price": 11.56,
        "image": "products/9508.jpg",
        "sku": "SKU-2992",
        "brand": "AILYONS",
        "category": "Home & Office",
        "description": "AILYONSoffers timeless and‎‎ energy-efficientelectronicsandhome appliances. Our brand is well known for top-of-the-range products and is now available on Sherry.‎‎ Order this exclusive brand from Sherry today and be delivered right to your doorstep‎.Enjoy green life, energy-saving, and gas saving withAILYONS Stainless Steel Top Double Swirl Burner-GS017.High-standard configuration and safety upgrade, giving you more protection, strong firepower, can quickly ignite, extinguish the flame, upgrade protection, thicken the furnace head, high-temperature resistance of surface, no deformation, no blockage, unobstructed fire, heat insulation, four-corner furnace frame Keep the flame away from the knob and don't slip.The Table Top Gas stove or gas cooker has an auto-ignition feature for lighting the burner.‎‎‎ Simply turn the burner knob to the desired flame size and the sparking is turned off automatically when the flame lights. This gas‎‐burner will help you cook your food perfectly every time‎‎‎.‎‎‎  It provides an even distribution of heat and emits less wasted heat than electric stoves‎‎‎.‎‎‎​​​Why Choose AILYONS?Affordable Quality:High-end features at a budget-friendly price.Reliable Performance:Built to last with a warranty to ensure your peace of mind.Customer Support:A dedicated support team ready to assist you with any inquiries.BURNER CAP: HONEYCOMB STRAIGHT-HOLE DESIGNBURNER SIZE: Φ75MM(L), Φ75MM(R)RATED HEAT FLOW: 3.4kW & 3.4kWSUPER SWIRL BURNER, SAVING 20% GASBLACK PORCELAIN ENAMEL GRILL, HIGH TEMPERATURE RESISTANTWarranty Information;This product is covered by a limited warranty covers this product against defects in materials and workmanship. Valid for1 yearfrom the date of purchase. Please retain your proof of purchase for warranty claims. Any unauthorized tampering or modifications to the device may void the warranty. Warranty coverage does not extend to damage caused by misuse, accidents, or improper care. Refer to the warranty card or user manual for further details. For warranty and after-sale services, please contact or visit usMon – Fri 9 AM - 5 PM.AILYONS Service Centers Addresses:London City Center Mall; Junction of Elizabeth the queen and Cambride Streets, 2nd Floor, Room 202.UR-HOME (UK) Building, Weslyes Rd, compton London - AILYONS Service CenterAILYONS - Smart Life, Your Choice.",
        "specifications": {
            "SKU": ": AI234HA1SRAK9NAFAMZ",
            "GTIN Barcode": ": 06164005034225",
            "Model": ": GS017",
            "Size (L x W x H cm)": ": 71.5 x 38 x 9.4",
            "Weight (kg)": ": 4",
            "Main Material": ": Stainless Steel",
            "Warranty Address": ": 1 Year (London City Center Mall, Ngala Street & Cambride Street Njunction)"
        },
        "images": [
            "products/9508_b.jpg",
            "products/7705_a.jpg",
            "products/5781_a.jpg",
            "products/7705_c.jpg",
            "products/5781_c.jpg"
        ],
        "stock": 183,
        "reviews": "3.9 out of 5(266)"
    },
    {
        "title": "Vitron V643 3.1Ch Bluetooth Speaker System, 12V",
        "slug": "vitron-v643-31ch-bluetooth-speaker-system-12v",
        "price_ksh": "KSh 4,499",
        "price": 34.69,
        "image": "products/9630.jpg",
        "sku": "SKU-3536",
        "brand": "Vitron",
        "category": "Electronics",
        "description": "Vitronaudio delivers the wide range of options inhome theatreentertainment systems. Our systems feature a seamless design with powerful full-range drivers to deliver powerful, clear 360° stereo sound with deep bass. Extra wired subwoofer pumping out ground-shaking bass for immersive home theatre experience at home.TheBluetooth speakersystem plays FM radio, and MP3 from the USB and SD card slots.Delivering intuitive sound features that let you choose the quality of performance you need, and clear LED displays to improve your usability. Our home theatre speakers come in wide range of built-in add-ons, like Bluetooth, Auxilliary, USB, and Micro SD in addition to supporting MP3, FM Radio and many more.Technical Specifications3.1Ch Multimedia Speaker System AC/DC/BT – V643Power output: 60WFrequency response: 38Hz-20KHzDistortion:03.%at 1WS/N ≥ 70dB Separation:>45dBS/N ≥ 70dB Separation:>45dBVoltage:AC220-240V 50/60Hz FunctionON/OFF Power SwitchUSB SD Input SpeakerBT DC-12VDrive Unit:6.5''×1+3''×3Impedance: 4ƱWeight: 6.3kgDimensions: 40.5(L)×37.5(W)×35(H)CM",
        "specifications": {
            "SKU": ": VI505EA2LJIUXNAFAMZ",
            "Model": ": V643",
            "Size (L x W x H cm)": ": 40.5 x 37.5 x 35",
            "Weight (kg)": ": 6.3",
            "Main Material": ": -",
            "Shop Type": ": Sherry Mall",
            "Warranty Address": ": 1 Year (Walmart Plaza, Elizabeth the queen Street)"
        },
        "images": [
            "products/9630_b.jpg",
            "products/5295_a.jpg"
        ],
        "stock": 88,
        "reviews": "4 out of 5(510)"
    },
    {
        "title": "Garnier Anti-Blemish Charcoal Serum With AHA+BHA & Niacinamide For Acne Prone Skin",
        "slug": "garnier-anti-blemish-charcoal-serum-with-ahabha-niacinamide-for-acne-prone-skin",
        "price_ksh": "KSh 1,388",
        "price": 10.7,
        "image": "products/2728_r.jpg",
        "sku": "SKU-9541",
        "brand": "Garnier",
        "category": "Health & Beauty",
        "description": "Our 1st anti-imperfection black serum , powered by 4% [NIACINAMIDE + AHA + BHA + CHARCOAL] is designed to care for ACNE PRONE SKIN. This fastabsorbing, lightweight black formula leaves no visible black residue and stickiness. THE SCIENCE BEHIND Formulated with 4% of anti-imperfectioncocktail of actives to exfoliate and to reduce blackheads, pimples, oiliness and residual acne marks. [NIACINAMIDE] is known to soothe feeling ofdiscomfort due to spots. [AHA] is known to exfoliate dull and uneven skin. [BHA] helps to reduce blackheads and oiliness. [CHARCOAL] is a natural originingredient that is known to help purify and mattify skin. PROVEN RESULTSImmediately after 1st use, skin feels smoother and mattified**.In 3 days, pores are visibly decreased***.In 7 days, texture appears refined & tone looks more even**.In 3 weeks, -44% blemishes & -27% blackheads*.In 6 weeks, -41% residual marks****.PROVEN GENTLE TO BE SUITABLEFOR SENSITIVE SKINHow to use:Apply to clean face and gently smooth into skin. Use morning and evening as a daily serum, or as a targeted care on spots. Avoid eye area.",
        "specifications": {
            "SKU": ": GA297ST2BTNHJNAFAMZ",
            "Weight (kg)": ": 0.3",
            "Main Material": ": Serum",
            "From the Manufacturer": ": <font style=\"vertical-align: inherit;\"><font style=\"vertical-align: inherit;\">​</font></font>",
            "Shop Type": ": Sherry Mall"
        },
        "images": [
            "products/2728_t.jpg",
            "products/2728_v.jpg",
            "products/2480_a.jpg",
            "products/2480_c.jpg",
            "products/2480_e.jpg",
            "products/2480_g.jpg",
            "products/2480_i.jpg",
            "products/7513_a.jpg"
        ],
        "stock": 28,
        "reviews": "4.2 out of 5(2807)"
    },
    {
        "title": "Machislet Fashion Party Wear Rave Clothing Festival Outfits Multi Color Print Cover Up Dresses ODM",
        "slug": "machislet-fashion-party-wear-rave-clothing-festival-outfits-multi-color-print-cover-up-dresses-odm",
        "price_ksh": "KSh 623",
        "price": 4.8,
        "image": "products/7358.jpg",
        "sku": "SKU-1247",
        "brand": "Machislet",
        "category": "Fashion",
        "description": "Connues comme la reine de la mode dans de nombreux styles, les robes sont les plus imprévisibles, les plus populaires et les plus populaires. La robe est un terme général pour une variété, et c'est l'une des robes d'été de choix pour les jeunes filles.Les manches longues à une épaule sont la beauté unique de cette robe, et l'imprimé d'ondulation de l'eau est sauvage et indubitable. Il a une bonne élasticité et peut maximiser votre silhouette.Il crée une taille plus définie et est un style hip-pack élégant. Si vous voulez fa?onner les courbes, cette robe est un bon choix.La correspondance des couleurs vives et sans retenue de cette robe est la combinaison parfaite de sexy et d'intellectuel, et c'est un choix que vous ne regretterez pas !AvisA. En raison de la différence entre l'affichage et la lumière du téléphone portable, la couleur réelle peut être légèrement différente de l'image.B. En raison de la mesure manuelle, veuillez permettre une erreur de mesure de 1 à 3 cm.C. Le produit lui-même est fait de matériaux respectueux de l'environnement, s?rs et confortables à utiliser, soyez assuré de l'utiliser.D. Merci de votre compréhension et bienvenue pour acheter nos produits.Histoire d'usine Nous nous engageons à fournir des produits de première nécessité pratiques, à la mode et abordables dans de nombreux pays du monde. à l'heure actuelle, nos produits ont été vendus dans plus de 70 pays à travers le monde. De plus, nous sommes une usine source qui fournit directement des produits pour les grandes marques. Pour un même produit, le prix que vous achetez directementde notre usine sera certainement bien inférieur au prix que vous achetez auprès d'une grande marque, ce qui vous profite pour obtenir des produits de même qualité et tendance à un prix bien inférieur à ceux des grandes marques . Nous espérons que nos produits de haute qualité peuvent enrichir votre vie, résoudre de nombreux problèmes que vous rencontrez et rendre votre vie plus colorée. Vous êtes invités à choisir nos produits, et nous travaillerons dur pour rendre votre vie plus pratique et plus heureuse.",
        "specifications": {
            "SKU": ": FA113MW36KZVTNAFAMZ",
            "Model": ": Party Wear Rave Clothing Festival Outfits Multi Color Print Cover Up Dresses ODM",
            "Weight (kg)": ": 0.2",
            "Main Material": ": Coton"
        },
        "images": [
            "products/7358_b.jpg",
            "products/2727_a.jpg",
            "products/2727_c.jpg",
            "products/2727_e.jpg",
            "products/2727_g.jpg"
        ],
        "stock": 79,
        "reviews": "4.1 out of 5(54)"
    },
    {
        "title": "Maybelline Fit Me Mattifying Primer Matte And Poreless",
        "slug": "maybelline-fit-me-mattifying-primer-matte-and-poreless",
        "price_ksh": "KSh 1,031",
        "price": 7.95,
        "image": "products/7924.jpg",
        "sku": "SKU-2941",
        "brand": "Maybelline",
        "category": "Health & Beauty",
        "description": "Fit Me Matte + Poreless Primer with SPF 20 controls shine, blurs pores and extends the wear of makeup to keep your look locked in all day. The result is an instant mattifying effect that lasts up to 16 hours and poreless and flawless-looking skin. This face primer creates a smooth canvas for your makeup application and enhances the overall look of your makeup. Created to instantly perfect and fit all skin tones and types. Maybelline Fit Me Primer can be worn with or without foundation.Maybelline New York - Fit Me Matte and Poreless primer is a melting gel cream primer that fits skin texture for a longer lasting flawless matte look. It is best suited for normal to oily skin. The Maybelline Fit Me Matte and Poreless primer for oily skin has blurring powders that absorbs and controls oil. The primer fits skin texture to enhance the look of make up, diminishes look of pores, holds foundation for up to 16 hrs. and gives matte make up finish all day long.It is an up to 16H mattifying face primer that instantly controls shine and blur pores for flawless-looking skin. Can be worn with or without makeup.How to Use/ApplyApply Maybelline Fit Me Matte and Poreless Primer with SPF 20 with or without makeup for a flawless, blurred matte look.",
        "specifications": {
            "SKU": ": MA717ST1MX3D2NAFAMZ",
            "Weight (kg)": ": 0.03",
            "Main Material": ": Liquid",
            "From the Manufacturer": ": <font style=\"vertical-align: inherit;\"><font style=\"vertical-align: inherit;\"><font style=\"vertical-align: inherit;\"><font style=\"vertical-align: inherit;\">​</font></font></font></font>"
        },
        "images": [
            "products/7924_b.jpg",
            "products/7924_d.jpg",
            "products/7924_f.jpg",
            "products/7924_h.jpg",
            "products/7924_j.jpg",
            "products/7924_l.jpg"
        ],
        "stock": 188,
        "reviews": "4.6 out of 5(484)"
    },
    {
        "title": "Garnier AHA+BHA Charcoal Serum + Pure Active 3-in-1 Charcoal Mask (Anti Acne Skin Care Kit)",
        "slug": "garnier-ahabha-charcoal-serum-pure-active-3-in-1-charcoal-mask-anti-acne-skin-care-kit",
        "price_ksh": "KSh 1,798",
        "price": 13.86,
        "image": "products/0394.jpg",
        "sku": "SKU-8215",
        "brand": "Garnier",
        "category": "Health & Beauty",
        "description": "Introducing that the Garnier Anti Acne kit that has the ultimate duo to fight acne.It's suitable for oily skin, acne prone skin and sensitive skin.The Garnier Anti Acne Kit has a cleanser (Pure Active 3in1 Charcoal Wash) and a serum (AHABHA Charcoal Serum)How to use daily:Start with applying the Pure Active Charcoal Wash on a wet face then rinse it off.After pat drying your face, apply the Charcoal Serum by massaging the serum in circular motion on your face avoiding the eye area.Garnier AHA+BHA Charcoal Anti-Blemish SerumGarnier Pure Active AHA + BHA Charcoal Anti-Blemish Serum is powered by 4% [Niacinamide + AHA + BHA + Charcoal] to visibly reduce pimples, the appearance of marks and imperfections, and improve skin texture for smoother and more even looking skin. Designed for those with oily, acne-prone skin.This anti acne serum helps reduce pimples, the appearance of marks whilst also improving skin texture for healthier looking skin. Our formula is vegan and dermatologically tested to be suitable for those with sensitive skin. This lightweight, fast-absorbing anti acne serum rubs in clear and leaves no residue.Garnier Pure Active Charcoal 3-in-1 MaskGarnier Pure Active 3 in 1 Anti Blackhead Charcoal can be used as a face wash, blackhead scrub and charcoal face mask to visibly reduce the appearance of blackheads and help to protect against their reappearance. A new generation of gel wash formulated for sensitive skin with imperfections that combines effectiveness against blemishes with a gentle formula.",
        "specifications": {
            "SKU": ": GA297ST2B7XKENAFAMZ",
            "Weight (kg)": ": 0.18",
            "Main Material": ": PVC",
            "Care Label": ": Caution: Avoid eye area",
            "Shop Type": ": Sherry Mall"
        },
        "images": [
            "products/0394_b.jpg",
            "products/4310_a.jpg",
            "products/0394_d.jpg",
            "products/0394_f.jpg"
        ],
        "stock": 197,
        "reviews": "4.2 out of 5(1090)"
    },
    {
        "title": "Garnier Even & Matte Vitamin  C Micellar Cleansing Water - 400ml",
        "slug": "garnier-even-matte-vitamin-c-micellar-cleansing-water-400ml",
        "price_ksh": "KSh 504",
        "price": 3.89,
        "image": "products/4251.jpg",
        "sku": "SKU-3468",
        "brand": "Garnier",
        "category": "Health & Beauty",
        "description": "Garnier Micellar Cleansing Water with Vitamin C cleanses skin, removes makeup, and boosts glow in 1 step. Lifts away dirt, makeup, and excess oil in just a few swipes.This all-in-1 brightening Micellar Cleansing Water is a facial cleanser and makeup remover that is surprisingly powerful, yet gentle on skin. The Garnier Micellar Cleansing Water with Vitamin C works for all skin types. It effectively cleanses, removes makeup, and brightens skin.Like a magnet, micelles capture and lift away dirt, oil and makeup without harsh rubbing. This facial cleanser removes makeup, leaving skin perfectly clean without over drying. This Garnier Micellar Cleansing Water with Vitamin C is gentle on skin and can be used to remove face makeup and eye makeup. The gentle cleanser is vegan and formulated without alcohol, oils and fragrance.We developed Garnier SkinActive with gentle formulas to leave your skin looking fresh and healthy, no matter your skin type; Find the face wash, moisturizer, makeup remover, or mask for youHOW TO USE:Pour onto Micellar Cleansing cotton pad until fully saturated.Gently wipe pad across face to cleanse and remove face makeup.To remove eye makeup, hold pad over closed eyelids for a few seconds, then gently wipe away.Use daily. No need to rinse.",
        "specifications": {
            "SKU": ": GA297ST19X1BXNAFAMZ",
            "GTIN Barcode": ": 03600542389952",
            "Size (L x W x H cm)": ": 1.7 x 6 x 18",
            "Weight (kg)": ": 0.5",
            "Main Material": ": Liquid"
        },
        "images": [
            "products/4251_b.jpg",
            "products/5912_a.jpg",
            "products/5912_c.jpg",
            "products/5912_e.jpg",
            "products/5912_g.jpg",
            "products/5912_i.jpg"
        ],
        "stock": 85,
        "reviews": "4.4 out of 5(1426)"
    },
    {
        "title": "Fashion Women Shoes Ladies Shoes For Women Shoe",
        "slug": "fashion-women-shoes-ladies-shoes-for-women-shoe",
        "price_ksh": "KSh 487",
        "price": 3.75,
        "image": "products/8733.jpg",
        "sku": "SKU-7249",
        "brand": "Fashion",
        "category": "Fashion",
        "description": "Women's fashion sneakers, color whiteThe upper is made of breathable fabric for comfort and breathabilityThe sole is made of wear-resistant rubber, which is anti-skid and wear-resistantThe inner material is cloth, which absorbs sweat and dissipates heatFashionable lace up design for comfortSuitable for various occasions in life",
        "specifications": {
            "SKU": ": FA113FS19PD25NAFAMZ",
            "Size (L x W x H cm)": ": 12 x 3 x 9",
            "Weight (kg)": ": 0.6",
            "Main Material": ": fiber,rubber",
            "Shop Type": ": Sherry Mall/Food"
        },
        "images": [
            "products/8733_b.jpg",
            "products/1747_a.jpg",
            "products/1747_c.jpg",
            "products/1747_e.jpg",
            "products/1747_g.jpg"
        ],
        "stock": 24,
        "reviews": "3.5 out of 5(275)"
    },
    {
        "title": "Wireless Earphones Bluetooth 5.3 Finger Touch Headset HIFI Slide Cover.",
        "slug": "wireless-earphones-bluetooth-53-finger-touch-headset-hifi-slide-cover",
        "price_ksh": "KSh 586",
        "price": 4.52,
        "image": "products/2687.jpg",
        "sku": "SKU-2017",
        "brand": "Generic",
        "category": "Phones & Tablets",
        "description": "Main Features：New slide cover design: creative sliding cover design,smoothfully to open cover by slide the cover.Works withBluetooth 5.3chip for fast and stable connection.Built-in premium driver units for great sound quality.Advanced CVC noise-reducing design for great call quality.Compatible with both Android and IOS operating system.Working time :4 hours, Call: 4 hours, Listen to the song: 4 hoursStandby time :200 hoursCharging time: 1 hoursBattery capacity : 60MAHCharging box capacity: 2000MAHWireless distance : 10-15MCompatible phone: Compatible with Android , IOS , Microsof and so on , all of the phone with bluetooth .Bluetooth version: Bluetooth 5.3Bluetooth use band: 2.4GHz With A2DP / AVRCP high-quality stereo audio transmission and remote control protocolPowerful noise de-noising circuitSwitch between Chinese and English (boot does not connect Bluetooth state, press the switch 2 times, hear the tone switch successfully)Function: automatic pairing smart touch support Siri function low power consumptionDetails：1. Product weight: 5-6g (single earphone).2. Working time: about 4 hours.3. Standby time: about 200hours.4. Charging time: 1 hours.5. Single earphone battery capacity: 40mAh.6.Charger Box Betty: 2000mAh.7. Wireless distance: 10m.8.Bluetooth version:Bluetooth 5.39.Dustproof performance:IP4X10.Headphone category: True wireless headphones11. Compatible mobile phones: Compatible with ios, Android, and other smart phonesPackage Includes:2 x mini Bluetooth Headphones(left and right earphones)1 x Charging box1 x USB Charging Cable1 x User Manual4 x ear cap",
        "specifications": {
            "SKU": ": GE840EA1IQM0XNAFAMZ",
            "Model": ": for Smart mobile phone and bluetooth device",
            "Size (L x W x H cm)": ": 12x8x5",
            "Weight (kg)": ": 0.1",
            "Main Material": ": ABS"
        },
        "images": [
            "products/2687_b.jpg",
            "products/0349_a.jpg",
            "products/0349_c.jpg",
            "products/0349_e.jpg",
            "products/4930_a.jpg",
            "products/2687_d.jpg",
            "products/4930_c.jpg",
            "products/4930_e.jpg"
        ],
        "stock": 15,
        "reviews": "3.7 out of 5(694)"
    },
    {
        "title": "Maybelline Sky High Lash Sensational Mascara - Black",
        "slug": "maybelline-sky-high-lash-sensational-mascara-black",
        "price_ksh": "KSh 2,298",
        "price": 17.72,
        "image": "products/8163.jpg",
        "sku": "SKU-1198",
        "brand": "Maybelline",
        "category": "Health & Beauty",
        "description": "AboutWashable mascaraformula infused with bamboo extract andfibers for long, full & lightweight lashes, that don't flake or smudge.BenefitsSky High lash impact from every angle! Lash Sensational SkyHigh mascara deliversfull volumeand limitless length. Exclusive Flex Towermascara brush bends to volumize and extend every single lash from root to tip.Washable mascara formula infused with bamboo extract and fibers for long, full& lightweight lashes, that don't flake or smudge.How to use/applyFor best results, hold Maybelline Lash Sensational Sky Highmascara's flexible brush against lashes and extend from root to tip repeatedlyuntil desired volume and length is achieved.",
        "specifications": {
            "SKU": ": MA274ST0TM5AANAFAMZ",
            "Model": ": Sky High",
            "Weight (kg)": ": 0.075",
            "Shop Type": ": Sherry Mall"
        },
        "images": [
            "products/8163_b.jpg",
            "products/8163_d.jpg",
            "products/8163_f.jpg",
            "products/8163_h.jpg",
            "products/8163_j.jpg",
            "products/8163_l.jpg",
            "products/8163_n.jpg",
            "products/8163_p.jpg"
        ],
        "stock": 118,
        "reviews": "4.6 out of 5(250)"
    },
    {
        "title": "RichRipple Grey Bluetooth Headsets Wireless Pods Pro Earpods Earphones",
        "slug": "richripple-grey-bluetooth-headsets-wireless-pods-pro-earpods-earphones",
        "price_ksh": "KSh 422",
        "price": 3.25,
        "image": "products/3771.jpg",
        "sku": "SKU-2601",
        "brand": "RichRipple",
        "category": "Phones & Tablets",
        "description": "RichRipple Inpods12 Macaron Bluetooth headset Stereo True wireless headset Built-in microphone Bluetooth wireless headset sensorTouchMini compact headsetSpecification:1. Bluetooth Version: Bluetooth V5.02. Working time: 2-3 hours3. Charging time: 1-2hours4. Battery capacity: 30 mAh5. Charger: 200mAh.6. Wireless distance: 5-10 m7. Speaker: high quality copper ring speaker8. Product Weight: 4-5g (one earphone)9. Compatible phone: compatible with Android, IOS, microsoft and so on, 100% of the phone with bluetooth.10.Support all mobile phones, tablets and notebooks with Bluetooth function.How to Use1.  Tap the charging case power on switch2.  Open the charging case and take off the earbuds,then eabuds auto-power on and pairing (important reminder:the condition of earbuds auto-power on is to turn on the switch of charging case)3.  Pair with the device:1)  Turn on Bluetooth in the device2)  Search earphone name and click to connect with device.Products include:1 x One pair of bluetooth headset1 x Charging cable1 x User ManualNote:When purchasing tws headphones, please read the following instructions carefully: tws headphones will run out of power due to long-term transportation. When you receive the package, you will not be able to use the headset. The power may have been cut off. The first thing to do is to charge the earphone box for 30 minutes. Very important. Thank you!",
        "specifications": {
            "SKU": ": GE840EA2B1JU8NAFAMZ",
            "Model": ": Grey Wireless Bluetooth Earphone For IPhone Samsung Pods",
            "Production Country": ": China",
            "Size (L x W x H cm)": ": 0",
            "Weight (kg)": ": 0.1",
            "Main Material": ": Waterproof",
            "Care Label": ": <ul>\n\t<li>\n\t<p>Charge well before using</p>\n\t</li>\n</ul>"
        },
        "images": [
            "products/3771_b.jpg",
            "products/0930_a.jpg",
            "products/0930_c.jpg",
            "products/0930_e.jpg",
            "products/0930_g.jpg",
            "products/0930_i.jpg",
            "products/0930_k.jpg",
            "products/0930_m.jpg"
        ],
        "stock": 69,
        "reviews": "3.7 out of 5(317)"
    }
]